-- phpMyAdmin SQL Dump
-- version 5.0.4
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: יוני 04, 2021 בזמן 11:02 AM
-- גרסת שרת: 10.4.17-MariaDB
-- PHP Version: 8.0.0

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `greenhouse`
--

-- --------------------------------------------------------

--
-- מבנה טבלה עבור טבלה `controlpaneltable`
--

CREATE TABLE `controlpaneltable` (
  `id` int(11) NOT NULL,
  `system` varchar(255) NOT NULL,
  `status` varchar(255) NOT NULL,
  `date` date NOT NULL DEFAULT current_timestamp(),
  `time` time NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- הוצאת מידע עבור טבלה `controlpaneltable`
--

INSERT INTO `controlpaneltable` (`id`, `system`, `status`, `date`, `time`) VALUES
(8, 'Water', 'Open', '2021-05-29', '15:23:02'),
(9, 'Net', 'Open', '2021-05-29', '15:24:24'),
(10, 'Water', 'Close', '2021-05-29', '15:24:28'),
(11, 'Net', 'Close', '2021-05-29', '15:24:31'),
(12, 'Water', 'Close', '2021-05-31', '16:35:05'),
(13, 'Water', 'Open', '2021-05-31', '16:40:58'),
(14, 'Water', 'Open', '2021-05-31', '16:41:43'),
(15, 'Water', 'Open', '2021-06-03', '20:26:00'),
(16, 'Water', 'Close', '2021-06-03', '20:26:06'),
(17, 'Water', 'Open', '2021-06-03', '20:26:30'),
(18, 'Water', 'Open', '2021-06-03', '20:26:37'),
(19, 'Net', 'Open', '2021-06-03', '20:27:10'),
(20, 'Net', 'Open', '2021-06-03', '20:29:55'),
(21, 'Net', 'Open', '2021-06-03', '20:30:51'),
(22, 'Net', 'Close', '2021-06-03', '20:32:23'),
(23, 'Net', 'Open', '2021-06-03', '20:32:31'),
(24, 'Water', 'Open', '2021-06-03', '20:32:36'),
(25, 'Water', 'Close', '2021-06-03', '20:32:44'),
(26, 'Water', 'Open', '2021-06-04', '10:51:53'),
(27, 'Water', 'Open', '2021-06-04', '10:51:54'),
(28, 'Water', 'Open', '2021-06-04', '10:51:55'),
(29, 'Water', 'Open', '2021-06-04', '10:51:55'),
(30, 'Water', 'Open', '2021-06-04', '10:51:56'),
(31, 'Water', 'Open', '2021-06-04', '10:51:59'),
(32, 'Water', 'Close', '2021-06-04', '11:31:58'),
(33, 'Net', 'Close', '2021-06-04', '11:31:59'),
(34, 'Water', 'Open', '2021-06-04', '11:32:09'),
(35, 'Net', 'Open', '2021-06-04', '11:32:10'),
(36, 'Water', 'Close', '2021-06-04', '11:37:41'),
(37, 'Net', 'Close', '2021-06-04', '11:37:43');

-- --------------------------------------------------------

--
-- מבנה טבלה עבור טבלה `netcontrol`
--

CREATE TABLE `netcontrol` (
  `id` int(11) NOT NULL,
  `Stat` int(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- הוצאת מידע עבור טבלה `netcontrol`
--

INSERT INTO `netcontrol` (`id`, `Stat`) VALUES
(0, 0);

-- --------------------------------------------------------

--
-- מבנה טבלה עבור טבלה `sensortable`
--

CREATE TABLE `sensortable` (
  `id` int(11) NOT NULL,
  `temperature` varchar(255) NOT NULL,
  `humidity` varchar(255) NOT NULL,
  `date` date NOT NULL,
  `time` time NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- הוצאת מידע עבור טבלה `sensortable`
--

INSERT INTO `sensortable` (`id`, `temperature`, `humidity`, `date`, `time`) VALUES
(1, '28', '5', '2021-05-01', '16:06:09'),
(2, '26', '5', '2021-05-01', '18:06:09'),
(3, '33', '2', '2021-05-02', '06:07:20'),
(4, '30', '6', '2021-05-02', '09:07:20'),
(5, '23', '6', '2021-05-03', '10:08:18'),
(6, '25', '6', '2021-05-03', '13:08:18'),
(7, '30', '20', '2021-05-21', '19:06:42'),
(11, '25.13', '4', '2021-05-22', '11:31:51'),
(12, '25.13', '4', '2021-05-22', '11:32:02'),
(13, '25.13', '2', '2021-05-22', '11:32:13'),
(14, '25.13', '2', '2021-05-22', '11:32:24'),
(15, '25.13', '2', '2021-05-22', '11:32:36'),
(16, '25.13', '3', '2021-05-22', '11:32:47'),
(17, '28.63', '0', '2021-05-31', '16:34:32'),
(18, '28.63', '0', '2021-05-31', '16:34:43'),
(19, '28.63', '0', '2021-05-31', '16:35:15'),
(20, '28.63', '0', '2021-05-31', '16:35:26'),
(21, '28.63', '0', '2021-05-31', '16:35:37'),
(22, '28.75', '0', '2021-05-31', '16:35:48'),
(23, '28.75', '0', '2021-05-31', '16:35:59'),
(24, '28.75', '0', '2021-05-31', '16:36:11'),
(25, '28.75', '0', '2021-05-31', '16:36:22'),
(26, '28.75', '0', '2021-05-31', '16:36:33'),
(27, '28.75', '0', '2021-05-31', '16:36:44'),
(28, '28.75', '0', '2021-05-31', '16:36:55'),
(29, '28.75', '0', '2021-05-31', '16:37:06'),
(30, '28.75', '0', '2021-05-31', '16:37:18'),
(31, '28.75', '0', '2021-05-31', '16:37:29'),
(32, '28.75', '0', '2021-05-31', '16:37:40'),
(33, '28.75', '0', '2021-05-31', '16:37:51'),
(34, '28.75', '0', '2021-05-31', '16:38:05'),
(35, '28.75', '0', '2021-05-31', '16:38:16'),
(36, '28.75', '0', '2021-05-31', '16:38:27'),
(37, '28.88', '0', '2021-05-31', '16:39:51'),
(38, '28.88', '0', '2021-05-31', '16:40:03'),
(39, '28.88', '0', '2021-05-31', '16:40:32'),
(40, '28.88', '0', '2021-05-31', '16:40:43'),
(41, '28.88', '0', '2021-05-31', '16:40:54'),
(42, '28.88', '0', '2021-05-31', '16:41:05'),
(43, '28.88', '0', '2021-05-31', '16:41:16'),
(44, '28.88', '0', '2021-05-31', '16:41:27'),
(45, '28.88', '0', '2021-05-31', '16:41:39'),
(46, '29.00', '0', '2021-05-31', '16:41:50'),
(47, '28.88', '0', '2021-05-31', '16:42:01'),
(48, '29.00', '0', '2021-05-31', '16:42:12'),
(49, '29.00', '0', '2021-05-31', '16:42:23'),
(50, '29.00', '0', '2021-05-31', '16:42:34'),
(51, '29.00', '0', '2021-05-31', '16:42:45'),
(52, '29.00', '0', '2021-05-31', '16:42:57'),
(53, '29.00', '0', '2021-05-31', '16:43:08'),
(54, '29.00', '0', '2021-05-31', '16:43:19'),
(55, '29.00', '0', '2021-05-31', '16:43:30'),
(56, '29.00', '0', '2021-05-31', '16:43:41'),
(57, '29.00', '0', '2021-05-31', '16:43:52'),
(58, '29.00', '0', '2021-05-31', '16:44:04'),
(59, '29.00', '0', '2021-05-31', '16:44:15'),
(60, '29.00', '0', '2021-05-31', '16:44:26'),
(61, '29.00', '0', '2021-05-31', '16:44:37'),
(62, '29.00', '0', '2021-05-31', '16:44:48'),
(63, '29.00', '0', '2021-05-31', '16:44:59'),
(64, '29.00', '0', '2021-05-31', '16:45:10'),
(65, '29.00', '0', '2021-05-31', '16:45:30'),
(66, '29.00', '0', '2021-05-31', '16:45:41'),
(67, '29.00', '0', '2021-05-31', '16:45:52'),
(68, '29.00', '0', '2021-05-31', '16:46:03'),
(69, '29.00', '0', '2021-05-31', '16:46:14'),
(70, '29.00', '0', '2021-05-31', '16:46:25'),
(71, '29.00', '0', '2021-05-31', '16:46:36'),
(72, '29.13', '0', '2021-05-31', '16:50:45'),
(73, '29.13', '0', '2021-05-31', '16:50:56'),
(74, '29.13', '0', '2021-05-31', '16:51:07'),
(75, '29.25', '0', '2021-05-31', '16:51:18'),
(76, '29.13', '0', '2021-05-31', '16:51:29'),
(77, '29.38', '0', '2021-05-31', '16:59:03'),
(78, '29.38', '0', '2021-05-31', '16:59:14'),
(79, '29.38', '0', '2021-05-31', '16:59:25'),
(80, '29.38', '0', '2021-05-31', '16:59:36'),
(81, '29.38', '0', '2021-05-31', '16:59:47'),
(82, '26.50', '0', '2021-06-04', '11:33:47'),
(83, '26.63', '0', '2021-06-04', '11:34:28'),
(84, '26.75', '0', '2021-06-04', '11:38:23'),
(85, '27.00', '0', '2021-06-04', '11:48:50');

-- --------------------------------------------------------

--
-- מבנה טבלה עבור טבלה `users`
--

CREATE TABLE `users` (
  `id` int(11) NOT NULL,
  `username` varchar(255) NOT NULL,
  `email` varchar(255) NOT NULL,
  `password` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- הוצאת מידע עבור טבלה `users`
--

INSERT INTO `users` (`id`, `username`, `email`, `password`) VALUES
(1, '1', '1@1', 'c4ca4238a0b923820dcc509a6f75849b');

-- --------------------------------------------------------

--
-- מבנה טבלה עבור טבלה `watercontrol`
--

CREATE TABLE `watercontrol` (
  `id` int(11) NOT NULL,
  `Stat` int(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- הוצאת מידע עבור טבלה `watercontrol`
--

INSERT INTO `watercontrol` (`id`, `Stat`) VALUES
(0, 0);

-- --------------------------------------------------------

--
-- מבנה טבלה עבור טבלה `watertable`
--

CREATE TABLE `watertable` (
  `id` int(11) NOT NULL,
  `amount` float NOT NULL,
  `sum` float NOT NULL,
  `date` date NOT NULL,
  `time` time NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- הוצאת מידע עבור טבלה `watertable`
--

INSERT INTO `watertable` (`id`, `amount`, `sum`, `date`, `time`) VALUES
(2, 8, 4, '2021-05-03', '16:14:43'),
(3, 10, 5, '2021-05-03', '21:34:35'),
(4, 15, 7.5, '2021-05-05', '13:35:04'),
(5, 8, 4, '2021-05-05', '18:35:04'),
(6, 20, 10, '2021-05-07', '18:35:50'),
(7, 10, 5, '2021-05-07', '16:35:50'),
(8, 4, 2, '2021-05-22', '11:32:51'),
(9, 1, 0.5, '2021-05-31', '16:51:00'),
(10, 1, 0.5, '2021-05-31', '16:51:22');

--
-- Indexes for dumped tables
--

--
-- אינדקסים לטבלה `controlpaneltable`
--
ALTER TABLE `controlpaneltable`
  ADD PRIMARY KEY (`id`);

--
-- אינדקסים לטבלה `netcontrol`
--
ALTER TABLE `netcontrol`
  ADD PRIMARY KEY (`id`);

--
-- אינדקסים לטבלה `sensortable`
--
ALTER TABLE `sensortable`
  ADD PRIMARY KEY (`id`);

--
-- אינדקסים לטבלה `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`);

--
-- אינדקסים לטבלה `watercontrol`
--
ALTER TABLE `watercontrol`
  ADD PRIMARY KEY (`id`);

--
-- אינדקסים לטבלה `watertable`
--
ALTER TABLE `watertable`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `controlpaneltable`
--
ALTER TABLE `controlpaneltable`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=38;

--
-- AUTO_INCREMENT for table `sensortable`
--
ALTER TABLE `sensortable`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=86;

--
-- AUTO_INCREMENT for table `users`
--
ALTER TABLE `users`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `watertable`
--
ALTER TABLE `watertable`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=11;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
